#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

#### Preview environment 🔗
["https://terraform-managed-arrangement-svc-preview-api.bekk.dev/arrangement-svc*"
]("https://terraform-managed-arrangement-svc-preview-api.bekk.dev/arrangement-svc*"
)

<details><summary>Show plan for apply after merge to master</summary>

```hcl

terraform
Acquiring state lock. This may take a few moments...
module.aws-deploy.aws_ecs_task_definition.main: Refreshing state... [id=bekk-arrangement-svc-dev]
module.aws-deploy.aws_lb_target_group.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/bekk-arrangement-svc-dev/2ce04acd3c5167ac]
module.aws-deploy.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-svc-dev]
module.aws-deploy.aws_lb_listener_rule.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:882089634282:listener-rule/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f/da09c5a7670ad5a8/049bbff9a0bfcb89]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.aws-deploy.aws_ecs_service.main has been deleted
  - resource "aws_ecs_service" "main" {
      - cluster                            = "arn:aws:ecs:eu-central-1:882089634282:cluster/bekk-ecs-cluster-dev" -> null
      - deployment_maximum_percent         = 200 -> null
      - deployment_minimum_healthy_percent = 50 -> null
      - desired_count                      = 0 -> null
      - enable_ecs_managed_tags            = false -> null
      - enable_execute_command             = false -> null
      - health_check_grace_period_seconds  = 0 -> null
      - iam_role                           = "aws-service-role" -> null
      - id                                 = "arn:aws:ecs:eu-central-1:882089634282:service/bekk-ecs-cluster-dev/bekk-arrangement-svc-dev" -> null
      - launch_type                        = "FARGATE" -> null
      - name                               = "bekk-arrangement-svc-dev" -> null
      - platform_version                   = "LATEST" -> null
      - propagate_tags                     = "NONE" -> null
      - scheduling_strategy                = "REPLICA" -> null
      - tags                               = {} -> null
      - tags_all                           = {} -> null
      - task_definition                    = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-svc-dev:18" -> null
      - wait_for_steady_state              = false -> null

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

      - deployment_controller {
          - type = "ECS" -> null
        }

      - load_balancer {
          - container_name   = "bekk-arrangement-svc-dev" -> null
          - container_port   = 80 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/bekk-arrangement-svc-dev/2ce04acd3c5167ac" -> null
        }

      - network_configuration {
          - assign_public_ip = false -> null
          - security_groups  = [
              - "sg-097e0d70b6ec82ec0",
            ] -> null
          - subnets          = [
              - "subnet-0ed6ff6ec68c430c2",
              - "subnet-0f92b4a5499fc1b1d",
            ] -> null
        }
    }

  # module.aws-deploy.aws_lb_listener_rule.main has changed
  ~ resource "aws_lb_listener_rule" "main" {
        id           = "arn:aws:elasticloadbalancing:eu-central-1:882089634282:listener-rule/app/bekk-lb-ecs-dev/6d410fcf59ca9e6f/da09c5a7670ad5a8/049bbff9a0bfcb89"
      + tags         = {}
        # (4 unchanged attributes hidden)


        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws-deploy.aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + cluster                            = "arn:aws:ecs:eu-central-1:882089634282:cluster/bekk-ecs-cluster-dev"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 50
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bekk-arrangement-svc-dev"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Terraform" = "true"
        }
      + tags_all                           = {
          + "Terraform" = "true"
        }
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "bekk-arrangement-svc-dev"
          + container_port   = 80
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-central-1:882089634282:targetgroup/bekk-arrangement-svc-dev/2ce04acd3c5167ac"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-097e0d70b6ec82ec0",
            ]
          + subnets          = [
              + "subnet-0ed6ff6ec68c430c2",
              + "subnet-0f92b4a5499fc1b1d",
            ]
        }
    }

  # module.aws-deploy.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:882089634282:task-definition/bekk-arrangement-svc-dev:18" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "882089634282.dkr.ecr.eu-central-1.amazonaws.com/arrangement-svc:38" -> "882089634282.dkr.ecr.eu-central-1.amazonaws.com/bekk-arrangement-svc:latest"
                    name             = "bekk-arrangement-svc-dev"
                    # (8 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "bekk-arrangement-svc-dev" -> (known after apply)
      ~ revision                 = 18 -> (known after apply)
        tags                     = {
            "Name"      = "bekk-arrangement-svc-dev"
            "Terraform" = "true"
        }
        # (9 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @omaen, Action: `pull_request`*